#include "function.h"


/*硬件链接*/
//STM32----------->OPENMV
// PG9------------>  P3
// PA9(TXD)------->  P0(RXD)
// PA10(RXD)------>  P1(TXD)
// GND------------>  GND（单片机、openmv、报警电路共地）
// 报警电路+5V供电，单片机3.3V供电


/*********************************************/
//功能：开发板上S3对应功能选择按键，
//			按第一下任务一，按第二下任务二
//			按第三下任务三，按第四下任务四
//未找到目标OLED、报警无动作，找到目标并测量完成声光报警、OLED显示
/*********************************************/
int main(void)
{
	ALL_Init();


  while(1)
  {
		if(cnt % 1 == 0)
			Key_Scan();
		if(cnt % 3 == 0)
			Find_Shape();
		if(cnt % 5 == 0)
			OLED_Refresh_Gram();
	}		
}
  


